Autodesk.Revit.DB.ExternalResourceBrowserData.AddResource(System.String,System.String,System.Collections.Generic.IDictionary`2{System.String,System.String})
Adds an external resource to the folder path by supplying the resource name, version and reference information.
resourceName:
The unique short name of external resource.
version:
The version of external resource.
referenceInformation:
The (String, String) map containing reference or lookup information that will
be stored in Revit.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The resourceName is not a valid resource name used to display in Revit external resource browse UI.
The name should be a unique non-empty short name and it should not contain any invalid character of \\/:*?"<>|.
The length of combined path(server name + folder path + resourceName) should not exceeds 259.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.ExternalResourceBrowserData.AddResource(System.String,System.Collections.Generic.IDictionary`2{System.String,System.String})
Adds an external resource to the folder path by supplying the resource name and reference information.
resourceName:
The unique short name of external resource.
referenceInformation:
The (String, String) map containing reference or lookup information that will
be stored in Revit.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The resourceName is not a valid resource name used to display in Revit external resource browse UI.
The name should be a unique non-empty short name and it should not contain any invalid character of \\/:*?"<>|.
The length of combined path(server name + folder path + resourceName) should not exceeds 259.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015